# GetLegendSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..GetLegendSettings Method
AnalysisDisplayStyle Class See Also
---
Get legend settings object from the style.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayLegendSettings GetLegendSettings()
```

Visual Basic
---
```text
Public Function GetLegendSettings As AnalysisDisplayLegendSettings
```

Visual C++
---
```text
public:
AnalysisDisplayLegendSettings^ GetLegendSettings()
```

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace